HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/cabin/omega
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.0001/cabin";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 65;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.2;
        value           uniform 0.2;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 0.2;
    }
    cabin_to_ice
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 0.2;
    }
}


// ************************************************************************* //
