HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/ice/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.0001/ice";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            zeroGradient;
    }
    ice_to_cabin
    {
        type            turbulentTemperatureCoupledBaffleMixed;
        value           uniform 260;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;
    }
    ice_to_exterior
    {
        type            turbulentTemperatureCoupledBaffleMixed;
        value           uniform 260;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;
    }
}


// ************************************************************************* //
